# clear variables and close windows
rm(list = ls(all = TRUE))
graphics.off()

#讀資料
setwd("C:/Users/User/Desktop/20180515多變量")
data<-read.csv("(去程)(原始資料).csv",header = TRUE, sep = ",")
head(data)
data[,4]<-as.Date(data[,4])#把日期當作日期
data<-data[order(data[,4]),]#排序
attach(data)

x8165<-data[路線==8165,]#整年份8165
x8166<-data[路線==8166,]#整年份8166
x8161<-data[路線==8161,]#整年份8161
x8163<-data[路線==8163,]#整年份8163


m<-min(which(x8165[,4]=="2016/1/1"))
M<-max(which(x8165[,4]=="2016/1/20"))
x8165_1<-x8165[m:M,]#8165的第一個月
head(x8165_1)
table(x8165[,7])

a<-c("台東","中央市場","簡易法庭","署東醫院","變電所","舊縣議會","新生國小","四維路口",
"更生路","馬蘭加油站","公東高工","馬蘭榮家","卑南農會","卑南","卑南國小","南王","卑南國中",
"十股","下賓朗","賓朗","種蓄場","美濃入口","東成","美濃","集貨場","煙草間","初鹿國中",
"明峰","初鹿","龍過脈","嘉豐入口","舊鹿鳴","四維","湖底","龍田","光榮","龍岡","龍田國小",
"鹿野國中","鹿野","鹿野鄉公所","水源地","瑞源","瑞源教會","瑞源農會","瑞興","瑞和","新豐",
"景豐","加拿","月眉國小","月眉","崁頂","親水公園","關山","關山國小","關山慈濟","米國學校",
"螢橋","德高","頂庄","忠慶","新興","池上國中","池上鄉公所","池上郵局","池上站","富里")

x8165_1[,7]<-factor(x8165_1[,7],levels=a,ordered=T)

plot(x=x8165_1[,6]/60,            # X軸的值
     y=x8165_1[,7],             # Y軸的值
     main="8165_1月,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
	yaxt='n') # Y軸名稱  
axis(2,c(1:length(a)),a)
