# clear variables and close windows
rm(list = ls(all = TRUE))
graphics.off()

#讀資料
setwd("C:/Users/User/Desktop/20180515多變量")#學校電腦
data<-read.csv("(去程)修改路名0514.csv",header = TRUE, sep = ",")
comdata<-read.csv("(去程)替代路名對照.csv",header = TRUE, sep = ",")

##對照表
head(data)
data[,4]<-as.Date(data[,4])#把日期當作日期
data<-data[order(data[,4]),]#排序

for(i in c(1:nrow(data))){
    if(data[i,1]==8161){
      data[i,1]=11
    }else if(data[i,1]==8163){
      data[i,1]=22
    }else if(data[i,1]==8165){
      data[i,1]=33
    }else{
      data[i,1]=44
    }
}
attach(data)

#四條路線代號
x33<-data[路線==33,]#整年份8165
x44<-data[路線==44,]#整年份8166
x11<-data[路線==11,]#整年份8161
x22<-data[路線==22,]#整年份8163

m<-min(which(x33[,4]=="2016/1/1"))
M<-max(which(x33[,4]=="2016/1/20"))
x33_1<-x33[m:M,]#8165的第一個月
head(x33_1)
#知道站點數

#n33為路線33的站點名稱
table(x33[,7])
length(which(table(x44[,7])!=0))
n33<-c("台東","中央市場","簡易法庭","署東醫院","變電所","新生國小","四維路口",
"更生路","馬蘭加油站","公東高工","馬蘭榮家","卑南農會","卑南","卑南國小","南王","卑南國中",
"十股","下賓朗","賓朗","種蓄場","美濃入口","東成","美濃","集貨場","煙草間","初鹿國中",
"明峰","初鹿","龍過脈","嘉豐入口","舊鹿鳴","四維","湖底","龍田","光榮",
"鹿野國中","鹿野","鹿野鄉公所","水源地","瑞源","瑞源教會","瑞源農會","瑞興","瑞和","新豐",
"景豐","加拿","月眉國小","月眉","崁頂","親水公園","關山","關山慈濟",
"螢橋","德高","頂庄","忠慶","新興","池上國中","池上鄉公所","池上郵局","池上站","富里")

table(x11[,7])
length(which(table(x11[,7])!=0))
which(table(x11[,7])==0)
length(n11)
n11<-c("台東","中央市場","簡易法庭","署東醫院","變電所","新生國小","四維路口",
      "馬蘭加油站","公東高工","馬蘭榮家","卑南農會","卑南","卑南國小","南王",
      "卑南國中","下賓朗","賓朗","美濃入口","東成","美濃","集貨場","煙草間",
      "初鹿國中","明峰","初鹿","龍過脈","嘉豐入口","舊鹿鳴","四維","湖底","龍田","光榮",
      "鹿野國中","鹿野","鹿野鄉公所","水源地","新豐","景豐","加拿","月眉國小",
      "月眉","親水公園","關山","關山慈濟","德高","頂庄","新興","池上國中",
      "池上鄉公所","池上郵局","池上站","富里")


n22<-c("台東","中央市場","簡易法庭","署東醫院","變電所","舊縣議會","新生國小","四維路口",
       "更生路","馬蘭加油站","公東高工","馬蘭榮家","卑南農會","卑南","卑南國小","南王",
       "卑南國中","十股","下賓朗","賓朗","種蓄場","美濃入口","東成","美濃","集貨場","煙草間",
       "初鹿國中","明峰","初鹿","龍過脈","嘉豐入口","舊鹿鳴","四維","湖底","龍田","光榮","龍岡",
       "龍田國小","鹿野國中","鹿野","鹿野鄉公所","水源地","瑞源","瑞源教會","瑞源農會","瑞興","瑞和",
       "新豐","景豐","加拿","月眉國小","月眉","崁頂","親水公園","關山","關山國小","關山慈濟",
       "米國學校","螢橋","德高","頂庄","忠慶","新興","池上國中","池上鄉公所","池上郵局","池上站","富里")
for(i in c(1:nrow(comdata))){
  for(j in c(1:length(n11))){
    if(comdata[i,1]==n11[j]){
      n11[j]=as.character(comdata[i,2])
    }
  }
}

#把站點排序
x33_1[,7]<-factor(x33_1[,7],levels=n33,ordered=T)

#路線33一月份的圖
plot(x=x33_1[,6]/60,            # X軸的值
     y=x33_1[,7],             # Y軸的值
     main="路線33_1月,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
	yaxt='n') # Y軸名稱  
axis(2,c(1:length(n33)),n33)
#--------------------------------------------------------------
#整年份四條路線圖
window()
par(mfrow=c(2,2))

#把站點排序
x33[,7]<-factor(x33[,7],levels=n33,ordered=T)
plot(x=x33[,6]/60,            # X軸的值
     y=x33[,7],             # Y軸的值
     main="路線33_年,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
     yaxt='n') # Y軸名稱  
axis(2,c(1:length(n33)),n33)

#把站點排序
x11[,7]<-factor(x11[,7],levels=n11,ordered=T)
plot(x=x11[,6]/60,            # X軸的值
     y=x11[,7],             # Y軸的值
     main="路線11_年,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
     yaxt='n') # Y軸名稱  
axis(2,c(1:length(n11)),n11)

plot(x=x22[,6]/60,            # X軸的值
     y=x22[,7],             # Y軸的值
     main="路線22_年,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
     yaxt='n') # Y軸名稱  
axis(2,c(1:length(n22)),n22)

plot(x=x44[,6]/60,            # X軸的值
     y=x44[,7],             # Y軸的值
     main="路線44_年,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
     yaxt='n') # Y軸名稱  
axis(2,c(1:length(n44)),n44)
#----------------------------------------------------


