# clear variables and close windows
rm(list = ls(all = TRUE))
graphics.off()

#讀資料
x44<-read.csv("路線33.csv" ,header = TRUE, sep = ",")

comdata<-read.csv("(去程)替代路名對照.csv" ,header = TRUE, sep = ",")

n44<-c("台東","新生站","中央市場","署東醫院","簡易法庭","變電所","新生國小","更生路","四維路口",
       "馬蘭加油站","公東高工","馬蘭榮家","卑南農會","卑南","卑南國小","南王",
       "卑南國中","十股","下賓朗","賓朗","種蓄場","美濃入口","東成","美濃","集貨場","煙草間","初鹿國中",
       "明峰","初鹿","龍過脈","嘉豐入口","舊鹿鳴","四維","湖底","龍田","光榮","鹿野國中","鹿野","鹿野鄉公所","水源地",
       "瑞源","瑞源農會","瑞源教會","瑞興","瑞和","新豐","景豐","加拿","月眉國小",
       "月眉","崁頂","親水公園","關山","關山慈濟","螢橋","德高","頂庄","北庄","山平路","海端","隴下","初來","錦屏",
       "陸安","大同農場","池上鄉公所","池上郵局","池上站")

#把上車站點排序
x44[,7]<-factor(x44[,7],levels=n44,ordered=T) ;length(which(is.na(x44[,7]==T)))

windows()
par(mfrow=c(2,2))

#路線33整年的圖
for(i in c(1:nrow(comdata))){       #替換掉站名
  for(j in c(1:length(n44))){
    if(comdata[i,1]==n44[j]){
      n44[j]=as.character(comdata[i,2])
    }
  }
}
plot(x=x44[,6]/60,                 # X軸的值
     y=x44[,7],                    # Y軸的值
     main="路線44上車,時間與站點",     # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",                  # Y軸名稱
     yaxt='n')   
axis(2,c(1:length(n44)),n44)

#路線33整年各站點使用量
barplot(table(x44[,7]),axisnames = T,
        names.arg = n44, cex.names = 0.5,
        ylim = c(0,2000),
        main="路線44上車,站點Barplot",      # 圖片名稱
        xlab="站點",                    # X軸名稱
        ylab="Frequence")               # Y軸名稱 

##########################################################################
n44<-c("台東","新生站","中央市場","署東醫院","簡易法庭","變電所","新生國小","更生路","四維路口",
       "馬蘭加油站","公東高工","馬蘭榮家","卑南農會","卑南","卑南國小","南王",
       "卑南國中","十股","下賓朗","賓朗","種蓄場","美濃入口","東成","美濃","集貨場","煙草間","初鹿國中",
       "明峰","初鹿","龍過脈","嘉豐入口","舊鹿鳴","四維","湖底","龍田","光榮","鹿野國中","鹿野","鹿野鄉公所","水源地",
       "瑞源","瑞源農會","瑞源教會","瑞興","瑞和","新豐","景豐","加拿","月眉國小",
       "月眉","崁頂","親水公園","關山","關山慈濟","螢橋","德高","頂庄","北庄","山平路","海端","隴下","初來","錦屏",
       "陸安","大同農場","池上鄉公所","池上郵局","池上站")

#把下車站點排序
x44[,11]<-factor(x44[,11],levels=n44,ordered=T) ;length(which(is.na(x44[,11]==T)))

#下車整年份四條路線圖
#路線33整年的圖

for(i in c(1:nrow(comdata))){       #替換掉站名
  for(j in c(1:length(n44))){
    if(comdata[i,1]==n44[j]){
      n44[j]=as.character(comdata[i,2])
    }
  }
}

plot(x=x44[,10]/60,            # X軸的值
     y=x44[,11],             # Y軸的值
     main="路線44下車,時間與站點",   # 圖片名稱
     xlab="時間(小時)",            # X軸名稱
     ylab="站點",
     yaxt='n') # Y軸名稱  
axis(2,c(1:length(n44)),n44)


#路線33整年各站點使用量
barplot(table(x44[,11]),axisnames = T,
        names.arg = n44, cex.names = 0.5,
        ylim = c(0,2000),
        main="路線44下車,站點Barplot",      # 圖片名稱
        xlab="站點",                    # X軸名稱
        ylab="Frequence")               # Y軸名稱 
